In [1]:
import pandas as pd
import numpy as np

In [2]:
# dataFrame 1
d1 = {'Customer_id':[1,2,3,4,5,6],
     'Product':['Oven','Oven','Oven','Television','Television','Television']}
df1 = pd.DataFrame(d1)
 
# data frame 2
d2 = {'Customer_id':[2,4,6,7,8],
    'State':['California','California','Texas','Austria','Spain']}
df2 = pd.DataFrame(d2)

In [3]:
df1

   Customer_id     Product
0            1        Oven
1            2        Oven
2            3        Oven
3            4  Television
4            5  Television
5            6  Television

In [4]:
df2

   Customer_id       State
0            2  California
1            4  California
2            6       Texas
3            7     Austria
4            8       Spain

### Merge

<b>inner : </b> Return only the rows in which the left table have matching keys in the right table

In [5]:
# Inner  
pd.merge(df1, df2, on='Customer_id', how='inner')

   Customer_id     Product       State
0            2        Oven  California
1            4  Television  California
2            6  Television       Texas

<b>outer :</b> Returns all rows from both tables, join records from the left which have matching keys in the right table.

In [6]:
pd.merge(df1, df2, on='Customer_id', how='outer')

   Customer_id     Product       State
0            1        Oven         NaN
1            2        Oven  California
2            3        Oven         NaN
3            4  Television  California
4            5  Television         NaN
5            6  Television       Texas
6            7         NaN     Austria
7            8         NaN       Spain

<b>Left outer : </b> Return all rows from the left table, and any rows with matching keys from the right table.

In [14]:
pd.merge(df1, df2, on='Customer_id', how='left')

   Customer_id     Product       State
0            1        Oven         NaN
1            2        Oven  California
2            3        Oven         NaN
3            4  Television  California
4            5  Television         NaN
5            6  Television       Texas

In [15]:
pd.merge(df2, df1, on='Customer_id', how='left')

   Customer_id       State     Product
0            2  California        Oven
1            4  California  Television
2            6       Texas  Television
3            7     Austria         NaN
4            8       Spain         NaN

<b>Right outer :</b> Return all rows from the right table, and any rows with matching keys from the left table.

In [16]:
pd.merge(df1, df2, on='Customer_id', how='right')

   Customer_id     Product       State
0            2        Oven  California
1            4  Television  California
2            6  Television       Texas
3            7         NaN     Austria
4            8         NaN       Spain

In [18]:
pd.merge(df2, df1, on='Customer_id', how='right').sort_values(by='Customer_id')

   Customer_id       State     Product
3            1         NaN        Oven
0            2  California        Oven
4            3         NaN        Oven
1            4  California  Television
5            5         NaN  Television
2            6       Texas  Television

### Append()

In [19]:
ls1 = [['Ranjeet',44],['Mukul',88],['Sneha',79]]
df1 = pd.DataFrame(ls1, columns=['Name','Marks'])
df1

      Name  Marks
0  Ranjeet     44
1    Mukul     88
2    Sneha     79

In [20]:
ls2 = [['John',54],['Vinod',93]]
df2 = pd.DataFrame(ls2, columns=['Name','Marks'])
df2

    Name  Marks
0   John     54
1  Vinod     93

In [21]:
ddf3 = df1.append(df2)
# ddf3.index=[0,1,2,3,4]
ddf3

      Name  Marks
0  Ranjeet     44
1    Mukul     88
2    Sneha     79
0     John     54
1    Vinod     93

In [22]:
ddf3 = df1.append(df2)
ddf3.index=list(range(0,5))  # or [0,1,2,3,4]
ddf3

      Name  Marks
0  Ranjeet     44
1    Mukul     88
2    Sneha     79
3     John     54
4    Vinod     93

In [27]:
df1

      Name  Marks
0  Ranjeet     44
1    Mukul     88
2    Sneha     79

In [28]:
df2

    Name  Marks
0   John     54
1  Vinod     93

In [29]:
ls3 = [['Vibhuti',60],['Molly',98]]
df3 = pd.DataFrame(ls3, columns=['Name','Age'])
df3

      Name  Age
0  Vibhuti   60
1    Molly   98

In [30]:
df1.append(df3)

    Age  Marks     Name
0   NaN   44.0  Ranjeet
1   NaN   88.0    Mukul
2   NaN   79.0    Sneha
0  60.0    NaN  Vibhuti
1  98.0    NaN    Molly

In [31]:
ls4 = [[38000,'45-Ashok Vihar'],[32000,'28-Noida']]
df4 = pd.DataFrame(ls4, columns=['Salary','Address'])
df4

   Salary         Address
0   38000  45-Ashok Vihar
1   32000        28-Noida

In [32]:
df1.append(df4)

          Address  Marks     Name   Salary
0             NaN   44.0  Ranjeet      NaN
1             NaN   88.0    Mukul      NaN
2             NaN   79.0    Sneha      NaN
0  45-Ashok Vihar    NaN      NaN  38000.0
1        28-Noida    NaN      NaN  32000.0

### Concat

In [33]:
d = {'Name':['Alisa','Bobby','Cathrine','Madonna','Rocky','Sebastian','Jaqluine','Rahul','David'],
     'Score1':[62,47,55,74,31,77,85,63,42],
     'Score2':[89,87,67,55,47,72,76,79,44],
     'Score3':[56,86,77,45,73,62,74,89,71]}
df1 = pd.DataFrame(d)
df1

        Name  Score1  Score2  Score3
0      Alisa      62      89      56
1      Bobby      47      87      86
2   Cathrine      55      67      77
3    Madonna      74      55      45
4      Rocky      31      47      73
5  Sebastian      77      72      62
6   Jaqluine      85      76      74
7      Rahul      63      79      89
8      David      42      44      71

In [34]:
d = {'Name':['Andrew','Ajay','Teresa'],
     'Score1':[32,71,57],
     'Score2':[92,99,69],
     'Score3':[67,97,68]}
df2 = pd.DataFrame(d)
df2

     Name  Score1  Score2  Score3
0  Andrew      32      92      67
1    Ajay      71      99      97
2  Teresa      57      69      68

In [35]:
pd.concat([df1,df2])

        Name  Score1  Score2  Score3
0      Alisa      62      89      56
1      Bobby      47      87      86
2   Cathrine      55      67      77
3    Madonna      74      55      45
4      Rocky      31      47      73
5  Sebastian      77      72      62
6   Jaqluine      85      76      74
7      Rahul      63      79      89
8      David      42      44      71
0     Andrew      32      92      67
1       Ajay      71      99      97
2     Teresa      57      69      68

In [36]:
d = {
    'Name':['Jack','danny','vishwa'],
   'Score1':[32,71,70],
   'Score4':[72,91,89],
   'Score5':[57,72,78]}
 
df3 = pd.DataFrame(d)
df3

     Name  Score1  Score4  Score5
0    Jack      32      72      57
1   danny      71      91      72
2  vishwa      70      89      78

In [37]:
pd.concat([df1,df3])  # default axis=0

C:\Users\lenovo\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

        Name  Score1  Score2  Score3  Score4  Score5
0      Alisa      62    89.0    56.0     NaN     NaN
1      Bobby      47    87.0    86.0     NaN     NaN
2   Cathrine      55    67.0    77.0     NaN     NaN
3    Madonna      74    55.0    45.0     NaN     NaN
4      Rocky      31    47.0    73.0     NaN     NaN
5  Sebastian      77    72.0    62.0     NaN     NaN
6   Jaqluine      85    76.0    74.0     NaN     NaN
7      Rahul      63    79.0    89.0     NaN     NaN
8      David      42    44.0    71.0     NaN     NaN
0       Jack      32     NaN     NaN    72.0    57.0
1      danny      71     NaN     NaN    91.0    72.0
2     vishwa      70     NaN     NaN    89.0    78.0

In [38]:
pd.concat([df1,df3],axis=1)

        Name  Score1  Score2  Score3    Name  Score1  Score4  Score5
0      Alisa      62      89      56    Jack    32.0    72.0    57.0
1      Bobby      47      87      86   danny    71.0    91.0    72.0
2   Cathrine      55      67      77  vishwa    70.0    89.0    78.0
3    Madonna      74      55      45     NaN     NaN     NaN     NaN
4      Rocky      31      47      73     NaN     NaN     NaN     NaN
5  Sebastian      77      72      62     NaN     NaN     NaN     NaN
6   Jaqluine      85      76      74     NaN     NaN     NaN     NaN
7      Rahul      63      79      89     NaN     NaN     NaN     NaN
8      David      42      44      71     NaN     NaN     NaN     NaN

In [40]:
d = {
    'Name':['Jack','danny','vishwa'],
   'Score1':[32,71,70],
   'Score4':[72,91,89],
   'Score5':[57,72,78]}
 
df3 = pd.DataFrame(d)
df3

     Name  Score1  Score4  Score5
0    Jack      32      72      57
1   danny      71      91      72
2  vishwa      70      89      78

In [43]:
d1 = {'Score3':[56,86,77],
     'Score6':[78,89,93]}
df4 = pd.DataFrame(d1)
df4

   Score3  Score6
0      56      78
1      86      89
2      77      93

In [44]:
pd.concat([df3, df4], axis=1)

     Name  Score1  Score4  Score5  Score3  Score6
0    Jack      32      72      57      56      78
1   danny      71      91      72      86      89
2  vishwa      70      89      78      77      93

In [47]:
# Sort index based on column names
pd.concat([df3, df4], axis=1).sort_index(axis=1)

     Name  Score1  Score3  Score4  Score5  Score6
0    Jack      32      56      72      57      78
1   danny      71      86      91      72      89
2  vishwa      70      77      89      78      93

In [48]:
d2 = {'Score3':[56,86,77,80],
     'Score6':[78,89,93,65]}
df5 = pd.DataFrame(d2)
df5

   Score3  Score6
0      56      78
1      86      89
2      77      93
3      80      65

In [50]:
pd.concat([df3, df5], axis=1)

     Name  Score1  Score4  Score5  Score3  Score6
0    Jack    32.0    72.0    57.0      56      78
1   danny    71.0    91.0    72.0      86      89
2  vishwa    70.0    89.0    78.0      77      93
3     NaN     NaN     NaN     NaN      80      65

In [51]:
pd.concat([df3, df5])

C:\Users\lenovo\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

     Name  Score1  Score3  Score4  Score5  Score6
0    Jack    32.0     NaN    72.0    57.0     NaN
1   danny    71.0     NaN    91.0    72.0     NaN
2  vishwa    70.0     NaN    89.0    78.0     NaN
0     NaN     NaN    56.0     NaN     NaN    78.0
1     NaN     NaN    86.0     NaN     NaN    89.0
2     NaN     NaN    77.0     NaN     NaN    93.0
3     NaN     NaN    80.0     NaN     NaN    65.0

In [52]:
df3.append(df5)

C:\Users\lenovo\Anaconda3\lib\site-packages\pandas\core\frame.py:6692: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  sort=sort)

     Name  Score1  Score3  Score4  Score5  Score6
0    Jack    32.0     NaN    72.0    57.0     NaN
1   danny    71.0     NaN    91.0    72.0     NaN
2  vishwa    70.0     NaN    89.0    78.0     NaN
0     NaN     NaN    56.0     NaN     NaN    78.0
1     NaN     NaN    86.0     NaN     NaN    89.0
2     NaN     NaN    77.0     NaN     NaN    93.0
3     NaN     NaN    80.0     NaN     NaN    65.0

### Difference between concat and append

1) concat function takes axis=0/1 as its argument while append function has no such argument

### Apply, Applymap and Map

<b>apply():</b> 
<ol>
<li>Apply is defined on both series and dataframe</li>
<li>It operates row or column wise, i.e. along an axis. At times it operates element/cell wise.</li>
<li>Suited for more complex operations and aggregations(sum,mean)</li>
<li>Accepts a function as its agrument</li>
</ol>
<br>
  
<b>applymap():</b>
<ol>
<li>applymap is defined on DataFrames only</li>
<li>It operates elementwise on dataframes</li>
<li>Accepts a function as its agrument</li>    
</ol>
<br>
<b>map():</b>
<ol>
<li>map is defined on Series only</li>
<li>map operates elementwise on Series</li>
<li>map accepts dict or Series. It may also accept a function as its agrumnet</li>    
</ol>

### Apply

In [55]:
df = pd.DataFrame({"A":[25,36,49,64],"B":[1,4,9,16]},
                  index=['p', 'q','r','s'])
df

    A   B
p  25   1
q  36   4
r  49   9
s  64  16

In [57]:
#applymap is preferred over apply for this type of operation
df.apply(np.sqrt)

     A    B
p  5.0  1.0
q  6.0  2.0
r  7.0  3.0
s  8.0  4.0

In [129]:
df.applymap(np.sqrt)

     A    B
p  5.0  1.0
q  6.0  2.0
r  7.0  3.0
s  8.0  4.0

In [59]:
df.apply(np.sum,axis=0)

A    174
B     30
dtype: int64

In [60]:
df.apply(np.sum)

A    174
B     30
dtype: int64

In [63]:
df.apply(np.sum, axis=1)

p    26
q    40
r    58
s    80
dtype: int64

In [127]:
# applymap is preferred over apply for this type of operation
df.apply(lambda x:x**2)

      A    B
p   625    1
q  1296   16
r  2401   81
s  4096  256

In [128]:
df.applymap(lambda x:x**2)

      A    B
p   625    1
q  1296   16
r  2401   81
s  4096  256

In [69]:
df

    A   B
p  25   1
q  36   4
r  49   9
s  64  16

In [71]:
df.apply(lambda x: x.max() - x.min(),axis=0)

A    39
B    15
dtype: int64

In [72]:
df.apply(lambda x: x.max() - x.min(),axis=1)

p    24
q    32
r    40
s    48
dtype: int64

### Applymap

In [77]:
d1f = pd.DataFrame([[10, 15,73], [25, 40, 84]])
d1f

    0   1   2
0  10  15  73
1  25  40  84

In [78]:
def fun1(val):
    if(val%2==0):
        return val+10
    else:
        return val-5

In [79]:
d1f.applymap(fun1)

    0   1   2
0  20  10  68
1  20  50  94

In [81]:
d1f.apply(fun1)

ValueError: ('The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().', 'occurred at index 0')

In [130]:
# Apply function is preferred for aggregate functions like sum or mean
# avoid using applymap for the same
d1f.applymap(np.sum)

    A   B   C
0  10  15  73
1  25  40  84

In [88]:
d1f.apply(np.mean,axis=0) # column wise

0    17.5
1    27.5
2    78.5
dtype: float64

In [89]:
d1f.apply(np.mean,axis=1) # row wise

0    32.666667
1    49.666667
dtype: float64

In [91]:
d3 = [['hello','welcome','hi'],['bye','see you soon','be in touch']]
d2f = pd.DataFrame(d3,columns=['G1','G2','G3'])
d2f

      G1            G2           G3
0  hello       welcome           hi
1    bye  see you soon  be in touch

In [96]:
d2f.applymap(lambda x: len(x))

   G1  G2  G3
0   5   7   2
1   3  12  11

### Map

In [97]:
d1f.columns= ['A','B','C']
d1f

    A   B   C
0  10  15  73
1  25  40  84

In [99]:
d1f['A'].map(lambda x:x-5)

0     5
1    20
Name: A, dtype: int64

In [101]:
d1f.iloc[0].map(lambda x:x+7)

A    17
B    22
C    80
Name: 0, dtype: int64

In [102]:
d1f

    A   B   C
0  10  15  73
1  25  40  84

In [104]:
d1f['A'].map({10:'X',15:'XV',20:'XXV'})

0      X
1    NaN
Name: A, dtype: object

In [105]:
d1f['B'].map({10:'X',15:'XV',20:'XXV'})

0     XV
1    NaN
Name: B, dtype: object

In [107]:
d1f

    A   B   C
0  10  15  73
1  25  40  84

In [108]:
d1f[['A','B']].apply(np.sum) # default axis=0

A    35
B    55
dtype: int64

In [109]:
d1f[['A','B']].apply(np.mean)

A    17.5
B    27.5
dtype: float64

### Datetime

In [121]:
ls=['2018-03-22','2017-04-22','2019-06-28']
df7 = pd.DataFrame({'DateVal':ls})
df7

      DateVal
0  2018-03-22
1  2017-04-22
2  2019-06-28

In [122]:
df7.dtypes

DateVal    object
dtype: object

In [123]:
df7['DateVal'] = pd.to_datetime(df7['DateVal'])
df7.dtypes

DateVal    datetime64[ns]
dtype: object

In [124]:
df7['Date'] = df7['DateVal'].dt.day
df7['Month'] = df7['DateVal'].dt.month
df7['Year'] = df7['DateVal'].dt.year
df7

     DateVal  Date  Month  Year
0 2018-03-22    22      3  2018
1 2017-04-22    22      4  2017
2 2019-06-28    28      6  2019

In [125]:
df7['Hour'] = pd.to_datetime(df7['DateVal']).dt.hour
df7['Minute'] = pd.to_datetime(df7['DateVal']).dt.minute
df7['Second'] = pd.to_datetime(df7['DateVal']).dt.second
df7['Week'] = pd.to_datetime(df7['DateVal']).dt.week
df7['Day_of_Week'] = pd.to_datetime(df7['DateVal']).dt.dayofweek
df7

     DateVal  Date  Month  Year  Hour  Minute  Second  Week  Day_of_Week
0 2018-03-22    22      3  2018     0       0       0    12            3
1 2017-04-22    22      4  2017     0       0       0    16            5
2 2019-06-28    28      6  2019     0       0       0    26            4

In [126]:
df7['Day_of_Week'] = df7['Day_of_Week'].replace({3:'Wed',4:'Thu',5:'Fri'})
df7

     DateVal  Date  Month  Year  Hour  Minute  Second  Week Day_of_Week
0 2018-03-22    22      3  2018     0       0       0    12         Wed
1 2017-04-22    22      4  2017     0       0       0    16         Fri
2 2019-06-28    28      6  2019     0       0       0    26         Thu